In [1]:
import pandas as pd

df = pd.read_csv('../data/input/conf.csv', sep = None, engine='python')

colunas_para_excluir = ['MAQ BAN.', 'MAQ CL.', 'SERVIÇO', 'DATA', 'CLIENTE', 'ANIMAL', 'FORMA PGTO'];
df = df.drop(columns=colunas_para_excluir);
df = df.dropna()

colunas = list(df.columns)
colunas[0] = 'ID'
df.columns = colunas
df['ID'] = df['ID'].astype(int)

display(df)
df.to_csv('../data/input/filtered/filtered_df.csv', index=False)

        ID   VALOR
0   132711  110,00
1   132457  100,00
2   131642  200,00
3   132717   95,00
4   132005  400,00
..     ...     ...
69  132597  120,00
70  132817  375,00
71  132819   30,00
72  132821  175,00
73  132825   40,00

[69 rows x 2 columns]